Repository: Tauron1990/Radio-Streamer
Catalog: Tauron.Application.Audio/BassMessages.*.resx
Languages: de

# ErrorUnkown
source: Unkown Error
de: Unbekannter Fehler

# BASS_OK
source: No Error
de: Kein Fehler

# BASS_ERROR_MEM
source: Memory Error
de: Speicher Fehler

# BASS_ERROR_FILEOPEN
source: Can't open the file
de: Die Datei Konnte nicht geöffnet werden

# BASS_ERROR_DRIVER
source: Can't find a free/valid driver
de: Kein verfügbarer Audio Treiber

# BASS_ERROR_BUFLOST
source: The sample buffer was lost
de: Der audioPuffer ist nicht mehr Verfügbar

# BASS_ERROR_HANDLE
source: Invalid handle
de: Ungültiges Handle

# BASS_ERROR_FORMAT
source: Unsupported sample format
de: Nicht unterstütztes Format

# BASS_ERROR_POSITION
source: Invalid playback position
de: Ungültige Player Position

# BASS_ERROR_INIT
source: BASS_Init has not been successfully called
de: BASS_Init wurde nicht erfolgreich aufgerufen

# BASS_ERROR_START
source: BASS_Start has not been successfully called
de: BASS_Start wurde nicht erfolgreich Aufgerufen

# BASS_ERROR_NOCD
source: No CD in drive
de: Keine Cd im Laufwerk

# BASS_ERROR_CDTRACK
source: Invalid track number
de: Ungültige Track Nummer

# BASS_ERROR_NOPAUSE
source: Not paused
de: Nicht Pausiert

# BASS_ERROR_NOTAUDIO
source: Not an audio track
de: Kein Audio Track

# BASS_ERROR_NOCHAN
source: Can't get a free channel
de: Kein Freier Channel Verfügbar

# BASS_ERROR_ILLTYPE
source: An illegal type was specified
de: Ein ungültiger Type wurde Angegeben

# BASS_ERROR_ILLPARAM
source: An illegal parameter was specified
de: Ein ungültiger Paremeter wurde angegeben

# BASS_ERROR_NO3D
source: No 3D support
de: 3D wird nicht unterstützt

# BASS_ERROR_NOEAX
source: No EAX support
de: Keine EAX Unterstützung

source: BASS_ERROR_DEVICE
de: Ungültige Geräte Nurmmer

# BASS_ERROR_NOPLAY
source: Not playing
de: Spielt nicht

# BASS_ERROR_FREQ
source: Illegal sample rate
de: Ungültige Abtast Rate

# BASS_ERROR_NOTFILE
source: The stream is not a file stream
de: Der Stream ist keine Datei

# BASS_ERROR_NOHW
source: No hardware voices available
de: Keine Hardware Voices Verfügbar

# BASS_ERROR_EMPTY
source: The MOD music has no sequence data
de: Die MOD Musik hat keine Sequenz Daten

# BASS_ERROR_NONET
source: No internet connection could be opened
de: Es konnte keine Internetverbindung hergestellt werden

# BASS_ERROR_CREATE
source: Couldn't create the file
de: Die Datei konnte nicht erstellt werden

# BASS_ERROR_NOFX
source: Effects are not available
de: Effekte sind nicht Verfügbar

# BASS_ERROR_PLAYING
source: The channel is playing
de: Der Kanal wird abgespielt

# BASS_ERROR_NOTAVAIL
source: BASS_Requested data is not available
de: Die angeforderten Daten sind nicht Verfügbar

# BASS_ERROR_DECODE
source: The channel is a 'decoding channel' or Not
de: Der Kanal ist ein "Decoder Kanal"

# BASS_ERROR_DX
source: A sufficient DirectX version is not installed
de: Keine geeignete DirectX Version Installiert

# BASS_ERROR_TIMEOUT
source: Connection timedout
de: Verbindungs Timeout

# BASS_ERROR_FILEFORM
source: Unsupported file format
de: Dateiformat wird nicht unterstützt

# BASS_ERROR_SPEAKER
source: Unavailable speaker
de: Lautsprecher nicht Verfügbar

# BASS_ERROR_VERSION
source: Invalid BASS version (used by add-ons)
de: Ungültige Bass Version (genutzt von add-ons)

# BASS_ERROR_CODEC
source: Codec is not available/supported
de: Der Codec ist nicht Verfügbar/Unterstützt

# BASS_ERROR_ENDED
source: The channel/file has ended
de: Der Kanal/Die Datei ist Beendet

# BASS_ERROR_BUSY
source: The device is busy (eg. in "exclusive" use by another process)
de: Der Treiber ist Beschäftigt (z.B. "exklusive" nutzung durch einen anderen Prozess)

# BASS_ERROR_UNKNOWN
source: Some other mystery error
de: Ein Unbekannter Fehler ist eingetreten

# BASS_ERROR_WMA_LICENSE
source: BassWma: the file is protected
de: BassWma: Die Datei ist geschützt

# BASS_ERROR_WMA_WM9
source: BassWma: WM9 is required
de: BassWma: WM9 wird Benötigt

# BASS_ERROR_WMA_DENIED
source: BassWma: access denied (user/pass is invalid)
de: BassWma: Zugriff Verweigert(Nutzer/Passwort ist Falsch)

# BASS_ERROR_WMA_CODEC
source: BassWma: no appropriate codec is installed
de: BassWma: Kein Passender Codec ist Installiert

# BASS_ERROR_ACM_CANCEL
source: BassEnc: ACM codec selection cancelled
de: BassEnc: Acm Codec Auswahl abgebrochen

# BASS_ERROR_CAST_DENIED
source: BassEnc: Access denied (invalid password)
de: BassEnc: Zugriff Verweigert (Falsches Passwort)

# BASS_VST_ERROR_NOINPUTS
source: BassVst: the given effect has no inputs and is probably a VST instrument and no effect
de: BassVst: Der angegeben Effekt hat keine eingabe und ist möglicherweise ein Instrument und kein effekt

# BASS_VST_ERROR_NOOUTPUTS
source: BassVst: the given effect has no outputs
de: BassVst: Der effekt hat keine ausgabe

# BASS_VST_ERROR_NOREALTIME
source: BassVst: the given effect does not support realtime processing
de: BassVst Der Effekt unterstützt keine Echtzeit Verabeitung

# BASS_ERROR_VIDEO_ABORT
source: BASSVIDEO: Action was abort
de: BASSVideo: Aktion wurde Abgebrochen

# BASS_ERROR_VIDEO_CANNOT_CONNECT
source: BASSVIDEO: Cannot connect filter / pin.
de: BASSVideo: Kann keine Verbindung zum filter/Pin Herstellen

# BASS_ERROR_VIDEO_CANNOT_READ
source: BASSVIDEO: Cannot read file.
de: BASSVideo: Datei kann nicht gelesen werden

# BASS_ERROR_VIDEO_CANNOT_WRITE
source: BASSVIDEO: Cannot write file.
de: BASSVideo: Datei kann nicht geschrieben werden

# BASS_ERROR_VIDEO_FILTER
source: BASSVIDEO: Error cause by filter.
de: BASSVideo: Ein Filter hat einen Fehler Verursacht

# BASS_ERROR_VIDEO_INVALID_CHAN
source: BASSVIDEO: Invalid BassVideo channel.
de: BASSVideo: Ungültiger BassVideo channel

# BASS_ERROR_VIDEO_INVALID_DLL
source: BASSVIDEO: Wrong dll.
de: BASSVideo: Falsche Dll

# BASS_ERROR_VIDEO_INVALID_FORMAT
source: BASSVIDEO: Invalid format.
de: BASSVideo: Falsches Format

# BASS_ERROR_VIDEO_INVALID_HANDLE
source: BASSVIDEO: Invalid handle.
de: BASSVideo: Fehlerhaftes Handle

# BASS_ERROR_VIDEO_INVALID_PARAMETER
source: BASSVIDEO: Invalid parameter.
de: BASSVideo: Fehlerhafter Parameter

# BASS_ERROR_VIDEO_NO_AUDIO
source: BASSVIDEO: No sound.
de: BASSVideo: Kein Sound

# BASS_ERROR_VIDEO_NO_EFFECT
source: BASSVIDEO: No "Video Effect" detected.
de: BASSVideo: Kein "Video Eeffekt" gefunden

# BASS_ERROR_VIDEO_NO_INTERFACE
source: BASSVIDEO: Failed to querry interface.
de: BASSVideo: Fehler beim ansprechendes Interfaces

# BASS_ERROR_VIDEO_NO_RENDERER
source: BASSVIDEO: No renderer.
de: BASSVideo: Kein Renderer

# BASS_ERROR_VIDEO_NO_SUPPORT
source: BASSVIDEO: No support/Currently not supported.
de: BASSVideo: Nicht Unterstützt/Zurzeit nicht Unterstüzt

# BASS_ERROR_VIDEO_NO_VIDEO
source: BASSVIDEO: No Video.
de: BASSVideo: Kein Video

# BASS_ERROR_VIDEO_NOT_ALLOWED
source: BASSVIDEO: Not allowed.
de: BASSVideo: Nicht Verfügbar

# BASS_ERROR_VIDEO_NOT_CONNECTED
source: BASSVIDEO: Filter/Pin had not connected.
de: BASSVideo: Filter/Pin ist nicht Verbunden

# BASS_ERROR_VIDEO_NOT_EXISTS
source: BASSVIDEO: Not existing object.
de: BASSVideo: Das Object Existiert nicht

# BASS_ERROR_VIDEO_NOT_FOUND
source: BASSVIDEO: Object not found
de: BASSVideo: Object nicht gefunden
